<?php

return [
    'failed' => 'نام کاربری یا رمزعبور نادرست می باشد.',
    'password' => 'رمز عبور ارائه شده نادرست است.',
    'throttle' => 'تعداد تلاش های ناموفق زیاد بود . لطفا بعد از :seconds ثانیه ی دیگر تلاش کنید .',

    'register' => [
        'success' => 'ثبت نام شما با موفقیت انجام شد.',
    ],
    'login' => [
        'success' => 'لاگین شما با موفقیت انجام شد.',
        '2fa-required' => 'وارد کردن کد احراز هویت دو مرحله‌ای الزامی است.',
    ],
    'email-verification' => [
        'success' => 'حساب کاربری شما با موفقیت فعال شد.',
    ],
    'forget-password' => [
        'send' => 'اگر ایمیل شما در سیستم ما ثبت شده باشد، لینک تغییر رمز عبور به آن ارسال شده است. لطفاً ایمیل خود را بررسی کنید.',
    ],
    'too_many_attempts' => 'تعداد درخواست‌ها بیش از حد مجاز است. لطفاً بعداً تلاش کنید.',

];
