<?php

return [
    'created_succeed' => 'عملیات ساخت شما با موفقیت انجام شد.',
    'deleted_succeed' => 'رکورد با موفقیت حذف شد.',
    'server_error' => 'یک خطای غیرمنتظره رخ داده است. لطفاً بعداً دوباره تلاش کنید.',
    'wallet_refresh' => 'واریزی جدیدی یافت نشد. لطفا چند دقیقه دیگر دوباره تلاش کنید.',
    'wallet_refresh_succeed' => 'تراکنش واریز شما با موفقیت به کیف پول شما انتقال یافت.',
    'not_found' => 'مورد درخواستی یافت نشد.',
    'withdrawals' => [
        'check_withdrawal_success' => 'برداشت شما با موفقیت انجام شد.',
        'check_withdrawal_started' => 'فرآیند برداشت شما شروع شده است.',
        'check_withdrawal_error' => 'برداشت شما با شکست مواجه شد.',
    ],
    'user_financial_block' => [
        'withdrawal' => 'شما از برداشت تا :date مسدود شده‌اید.',
        'trade' => 'شما از معامله تا :date مسدود شده‌اید.',
    ],
    'otp' => [
        'send' => 'کد احراز هویت به ایمیل شما ارسال شد.',
    ],
];
