<!DOCTYPE html>
<html lang="fa" dir="rtl">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>قرارداد مضاربه شرعی</title>
    <style>


        body {
            font-family: 'iransans', sans-serif;
            font-size: 13px;
            line-height: 1.8;
            color: #333;
            margin: 10px;
            padding: 20px;
            background-color: #f9f9f9;
            direction: rtl;
            text-align: right;
        }

        .container {
            max-width: 900px;
            padding: 20px;
            background-color: #fff;
            border-radius: 8px;
            box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
        }

        .header {
            text-align: right;
            margin-bottom: 20px;
        }

        .header-info {
            text-align: left;
        }

        .header-info p {
            margin: 5px 0;
            font-size: 14px;
            color: #2c3e50;
        }

        h1 {
            font-size: 24px;
            text-align: center;
            color: #2c3e50;
            margin-bottom: 20px;
        }

        h2 {
            font-size: 20px;
            color: #34495e;
            margin-top: 20px;
            margin-bottom: 10px;
        }

        p {
            margin: 10px 0;
        }

        .verse {
            text-align: center;
            color: #555;
            margin-bottom: 20px;
        }

        .clause {
            margin-bottom: 10px;
        }

        .tab {
            margin-right: 20px;
        }

        .note, .tabnote {
            color: #e74c3c;
            font-size: 14px;
        }

        .bold {
            font-weight: bold;
        }

        hr {
            border: 0;
            border-top: 1px solid #ddd;
            margin: 20px 0;
        }

        @media print {
            body {
                background-color: #fff;
            }

            .container {
                box-shadow: none;
                padding: 0;
            }
        }

        .footer-table {
            width: 100%;
            margin-top: 30px;
            border-collapse: collapse;
        }

        .footer-table td {
            vertical-align: top;
            padding: 10px;
            width: 50%;
        }

        .footer-first-col {
            text-align: center;
            font-size: 11px;
        }

        .footer-sec-col {
            text-align: center;
        }

        .footer-sec-col-item {
            text-align: center;
            font-size: 11px;
            margin-bottom: 10px;
        }

        .footer-sec-col-item p {
            margin: 5px 0;
        }

        .stamp-signature-table {
            width: 100%;
            margin-top: 20px;
        }

        .stamp-signature-table td {
            text-align: center;
            vertical-align: middle;
            padding: 10px;
        }

        .stamp {
            width: 150px;
            height: 150px;
            text-align: center;
        }

        .signature {
            width: 150px;
            height: 150px;
            text-align: center;
        }
    </style>
</head>
<body>
<div class="container">
    <div class="header">
        <div class="header-info">
            <p>تاریخ: {{\App\Helpers\DateFormatter::convertToPersianDate($contract->created_at,'%Y/%m/%d')}}</p>
            <p>شماره: {{ $contract->contract_number }}</p>
        </div>
    </div>
    <div class="verse">
        <div>بسم اللّه الرحمن الرحیم</div>
        <div>(يَا أَيُّهَا الَّذِينَ آمَنُواْ أَوْفُواْ بِالْعُقُودِ) سوره مائده، آیه نخست</div>
        <div>قرارداد مضاربه شرعی مبتنی بر رمزارز و فضای مجازی</div>
    </div>

    <h2>ماده ۱: طرفین قرارداد</h2>
    <div class="clause">
        <p><span class="bold">۱-۱) مالک:</span> آقا/خانم {{ $contract->user->fullname() ?? $contract->user->username }}
            با کد ملی {{ $contract->user->national_code ?? $contract->user->username }} و صندوق پست الکترونیکی با
            آدرس {{ $contract->user->email ?? '.........................................' }} به عنوان سرمایه‌گذار شناخته
            می‌شود که از این پس در این قرارداد تحت عنوان (مالک) اشاره خواهد شد.</p>
    </div>
    <div class="clause">
        <p><span class="bold">۱-۲) مضارب:</span> فی مابین مجموعه بیتکس روم (<a href="http://bitexroom.com"
                                                                               target="_blank">bitexroom.com</a>) با
            مدیریت آقای علی اکبر توسل فرزند جمشید به کد ملی ۲۵۷۲۵۵۶۲۳۵ به نشانی استان فارس، شهرستان فسا، فاز ۴ گلستان،
            خیابان بوستان، پ ۹ و شماره تماس ۰۹۱۷۱۳۳۱۲۰۱ که عامل و مجری می‌باشند که من بعد در این قرارداد به عنوان
            (مضارب) ذکر می‌شود.</p>
        <p class="tabnote">تبصره: نشانی اعلامی مضارب از سوی طرفین و داور محترم بنابر تراضی ایشان (اقامتگاه قراردادی)
            بوده و در صورت هرگونه اختلاف احتمالی قضایی و... همین محل به عنوان اقامتگاه معتبر خواهد بود، مگر اینکه با
            ارسال اظهارنامه رسمی تغییر آن به طرف مقابل و داور مرضی الطرفین اعلام گردد.</p>
    </div>

    <h2>ماده ۲: سرمایه</h2>
    <div class="clause">
        <p>حداقل سرمایه‌گذاری معادل یک سهم می‌باشد، که هر سهم معادل {{ $stock->value ?? '.............' }} تتر و به ارزش
            0.0002 درصد از کل مجموعه بیتکس‌روم است. در
            مجموع {{ formatNumberTrimZeros($contract->amount) ?? '........' }} سهم به
            مبلغ {{ $contract->total_value ?? '........' }} تتر سرمایه‌گذاری شده است.</p>
        <p class="note">نکته: مالک می‌تواند به تعداد دلخواه در تأمین سهام مذکور مشارکت نماید.</p>
        <p>میزان سرمایه با توافق طرفین مبلغی است که کاربر از درگاه‌های مجاز و مسیرهای تعریف شده صرافی بیتکس روم پرداخت
            نموده یا از طریق رمز ارز به کیف پول مضارب انتقال داده است، که در صورت تمایل طرفین قابل افزایش بوده و در صورت
            افزایش مفاد این قرارداد نسبت به مابه‌التفاوت مذکور نیز اعمال خواهد شد که این مبالغ در این قرارداد به عنوان
            (سرمایه) ذکر خواهد شد.</p>
        <p class="note">توضیحات: {{$contract->description??'ندارد'}}</p>
    </div>

    <h2>ماده ۳: زمینه فعالیت و مدت قرارداد</h2>
    <div class="clause">
        <p>عامل (مضارب) با توجه به تخصص و آگاهی خویش در زمینه رمز ارزها (ارزهای دیجیتال) و معاملات راجع به آن و نیز سایر
            زمینه‌های مجاز و مشروع اقدام می‌نماید و مدت قرارداد در حال حاضر ۱۲ ماه تمام شمسی می‌باشد که با توجه به نوع
            فعالیت در صورت عدم اعلام رسمی (مالک) یا (مضارب) با ارسال اظهارنامه مبنی بر قصد اتمام فعالیت، به محض پایان
            (مدت قرارداد) برای همین مدّت با رعایت مفاد این قرارداد ادامه خواهد یافت.</p>
        <p class="tabnote">تبصره: مالک هر زمان که قصد برداشت وجه خود را داشته باشد این اختیار را دارد که بدون هیچ دلیلی
            مراتب فسخ خود را اعلام نماید، لذا می‌بایست از یک ماه قبل با کلیک بر دکمه لغو قرارداد به مضارب و تأیید آن با
            ارسال پیامک و واردکردن مقدار پیامک ارسالی مراتب فسخ را اعلام نماید، در این صورت صرفاً برداشت سرمایه بعد از
            انقضای مهلت 60 روزه کاری امکان پذیر می‌باشد.</p>
    </div>
    <h2>ماده ۴: حصه طرفین</h2>
    <div class="clause">
        <p>سهم (مالک) از منافع فعالیت‌های موضوع قرارداد، میزان سودی است که بر مبنای درآمد حاصله از فعالیت‌های (مضارب) در
            سایت تعیین شده و معادل {{ $contract->amount * 0.0002 ?? '……' }} درصد (تعداد سهام ضربدر 0.0002 درصد) از کل
            سود خالص مجموعه محاسبه می‌گردد. پرداخت این سود به صورت ماهیانه، از طریق واریز به حساب (مالک)، بر عهده
            (مضارب) می‌باشد. همچنین، (مالک) به جهت رعایت جهات شرعی، (مضارب) را در صورت عدم حصول منافع (با لحاظ شرایط
            قرارداد) از مسئولیت مبری نموده است که در این خصوص، صرف اعلام (مضارب) کفایت خواهد کرد.</p>
        <p class="tabnote">تبصره: (مالک) پذیرفت بابت انعقاد قرارداد نیم درصد از مبلغ قرارداد بابت تشریفات انعقاد قرارداد
            کسر گردد.</p>
    </div>

    <h2>ماده ۵: داور مرضی طرفین</h2>
    <div class="clause">
        <p>در صورت بروز نوسان مالی یا شرایط غیر قابل انتظار اعم از قوه قاهره و مانند آن، طرفین مؤسسه داوری نیک اندیشان
            دادآیین مهرزاد که به صورت تخصصی در زمینه موضوع داوری می‌نماید را به عنوان (داور مرضی الطرفین) تعیین نمودند
            که علاوه بر سایر موارد اختلاف عندالزوم در میزان حصه هر یک از طرفین بازنگری نماید و تصمیم نامبرده که با اعلام
            رسمی ایشان (ارسال اظهارنامه/پیامک/ پیام الکترونیک) به اطلاع مالک و مضارب خواهد رسید برای طرفین لازم الاجرا
            خواهد بود.</p>
        <p class="tabnote">تبصره: در صورت بروز هرگونه اختلاف در نحوه اجرای این قرارداد و نیز تفاوت برداشت در تفسیر مفاد
            آن، تصمیم داور مرضی الطرفین، که مبتنی بر شرایط روز، جهات فنی امر و عدل، انصاف و وجدان اتخاذ می‌شود حاکمیت
            داشته و برای هر دو طرف لازم الاجراست.</p>
    </div>

    <h2>ماده ۶: انتقال به غیر و واگذاری</h2>
    <div class="clause">
        <p>این قرارداد تا تاریخ {{ jdate($contract->created_at)->addMonths(24)->format('Y/m/d') }} غیرقابل انتقال و
            غیرقابل واگذاری است. هرگونه انتقال یا واگذاری حقوق و تعهدات ناشی از این قرارداد توسط (مالک)، بدون کسب موافقت
            کتبی (مضارب)، فاقد اعتبار حقوقی خواهد بود.</p>
    </div>

    <h2>ماده ۷: شرایط فسخ و واگذاری قرارداد</h2>
    <div class="clause">
        <p><span class="bold">۱-۷) تعهد (مالک) مبنی بر پرداخت جریمه فسخ:</span></p>
        <p class="tab">(مالک) به موجب این بند متعهد می‌گردد در صورت اعمال حق فسخ یکجانبه قرارداد طی دوره ۲۴ ماهه از
            تاریخ قابلیت انتقال و واگذاری، مبلغی معادل (بیست و دو درصد) از کل مبلغ قرارداد فسخ شده را به عنوان جریمه فسخ
            پرداخت نماید.</p>
        <p><span class="bold">۲-۷) مهلت و شرایط بازپرداخت مبلغ قرارداد پس از فسخ:</span></p>
        <p class="tab">در صورت اعمال حق فسخ توسط (مالک) مطابق بند (۱-۷) و پس از کسر جریمه ۲۲ درصدی موضوع این ماده،
            باقیمانده مبلغ قرارداد می‌بایست حداکثر ظرف مدت ۶۰ (شصت) روز کاری از تاریخ وصول درخواست کتبی فسخ، به (مالک)
            پرداخت شود.</p>
        <p><span class="bold">۳-۷) شرایط واگذاری پس از دوره تعهد اولیه:</span></p>
        <p class="tab">پس از انقضاء دوره ۲۴ ماهه مذکور در بند (۱-۷) و با احراز قابلیت انتقال موضوع قرارداد، در صورت
            تصمیم مالک به واگذاری یا انتقال حقوق و تعهدات ناشی از این قرارداد، کارمزدی معادل ۱% (یک درصد) از کل مبلغ
            قرارداد به عنوان هزینه انتقال دریافت خواهد شد.</p>
        <p class="tabnote">تبصره: محاسبه مبلغ کارمزد بر اساس ارزش قرارداد در تاریخ درخواست انتقال صورت خواهد پذیرفت.</p>
    </div>
    <h2>ماده ۸: تغییرات قرارداد</h2>
    <div class="clause">
        <p>مالک پذیرفت که در صورت اعمال تغییرات در بندهای قرارداد پس از تاریخ عقد، تغییرات اعمال‌شده شامل قراردادهای
            قبلی نیز خواهد بود و لازم‌الاجرا است.</p>
    </div>

    <h2>ماده ۹: سایر شرایط</h2>
    <div class="clause">
        <p><span class="bold">۱-۹)</span> چنانچه مالک سهواً یا عمداً سعی بر فریب مضارب داشته باشد، سایت بیتکس روم این حق
            و امکان را دارد که صرف نظر از پیگیری حقوقی موضوع، به طور موقت حساب کاربری مالک را متوقف و بعد از بررسی و
            جبران خسارات وارد شده به مضارب فعالیت مالک از سر گرفته خواهد شد.</p>
        <p><span class="bold">۲-۹)</span> مالک باید قبل از ارسال نسخ تمامی مشخصات و مدارک خود را حسب رویه احراز هویت در
            صرافی بیتکس روم در اختیار مضارب قرار دهد و بعد از احراز، تمامی کاربران می‌توانند نسخ قرارداد را از پنل
            کاربری خود دانلود، پرینت، امضا و ارسال نمایند، مالک مسئول وارد کردن صحیح آدرس کیف پول و هرگونه اطلاعات
            می‌باشد و عواقب هرگونه خطایی از سمت مالک به عهده خودش می‌باشد و مضارب مسئولیتی در قبال این موضوع ندارد،
            کاربر باید اطلاعات کاربری خود را شامل نام کاربری و رمز عبور و ایمیل را به نحو محرمانه حفظ نماید و مضارب
            مسئول هر گونه سوء استفاده از این اطلاعات نمی‌باشد.</p>
    </div>
    <h2>توضیحات</h2>
    <div class="clause">
        <p>قرارداد فوق مطابق مفاد ۱۰، ۱۹۰ و ۵۴۶ الی ۵۶۰ قانون مدنی، قانون تجارت الکترونیک و با رعایت موازین شرعی تنظیم
            شده است و طرفین اقرار به مطالعه کامل، وجود شرایط لازم جهت انعقاد قرارداد و نیز اعتبار امضای الکترونیک خویش
            دارند و قرارداد حاضر را صرف نظر از محل اقامت مطابق مقررات جمهوری اسلامی ایران و در صلاحیت مراجع شبه قضایی و
            قضایی این کشور اعلام می‌نمایند، مطابق ماده ۶۴ قانون تجارت الکترونیک حق تکثیر، اجرا و توزیع (عرضه و نشر) آثار
            تحت حمایت قانون حقوق مولفان، مصنفان و هنرمندان مصوب ۰۳/۰۹/۱۳۴۸ و قانون ترجمه و تکثیر کتب و نشریات و آثار
            صوتی مصوب ۲۶/۰۹/۱۳۵۲ و قانون حمایت از حقوق پدیدآورندگان نرم افزارهای رایانه‌ای مصوب ۰۴/۱۰/۱۳۷۹، به صورت داده
            پیام منحصراً در اختیار مؤلف است. کلیه آثار و تألیفاتی که در قالب داده پیام می‌باشند، از جمله اطلاعات، نرم
            افزارها و برنامه‌های رایانه‌ای، ابزار و روشهای رایانه‌ای و پایگاه‌های داده و همچنین حمایت از حقوق مالکیت‌های
            فکری در بستر مبادلات الکترونیکی شامل حق اختراع، حق طراحی، حق مؤلف، حقوق مرتبط با حق مؤلف، حمایت از
            پایگاه‌های داده، حمایت از نقشه مدارهای یکپارچه قطعات الکترونیکی (Integrated Circuits & Chips) و حمایت از
            اسرار تجاری، مشمول قوانین مذکور در این ماده و قانون ثبت علائم و اختراعات مصوب ۰۱/۰۴/۱۳۱۰ و آیین‌نامه اصلاحی
            اجرای قانون ثبت علائم تجاری و اختراعات مصوب ۱۴/۰۴/۱۳۳۷ خواهد بود، منوط بر آن که امور مذکور در آن دو قانون
            موافق مصوبات مجلس شورای اسلامی باشد و هر گونه کپی‌برداری از این قرارداد یا سوء‌استفاده از آن مورد پیگرد
            قانونی قرار خواهد گرفت، تمامی اطلاعات و محتوای سایت بیتکس روم من جمله مسائل مالی یا هویتی کاربران، خصوصی و
            محرمانه بوده و مضارب متعهد است هیچ گونه اطلاعاتی از کاربران در اختیار اشخاص حقیقی و حقوقی، ارگان‌ها یا
            نهادهای دولتی یا غیر دولتی قرار نگیرد مگر با امر مقامات قضایی ذیصلاح که در این فرض قانوناً الزامی است.</p>
    </div>
    <footer>
        <table class="footer-table">
            <tr>
                <td class="footer-first-col">
                    <p>سرمایه گذار (مالک)</p>
                    <p>امضا و اثر انگشت</p>
                    <p style="color: red">**برابر ماده ۷ قانون تجارت الکترونیک، هرگاه قانون وجود امضاء الکترونیکی مکفی است و
                        ثبت‌نام در سایت bitexroom.com به منزله امضاء الکترونیکی می‌باشد**</p>
                </td>
                <td class="footer-sec-col">
                    <div class="footer-sec-col-item">
                        <p>مضارب</p>
                        <p>امضا و مهر</p>
                    </div>
                    <table class="stamp-signature-table">
                        <tr>
                            <td class="stamp">
                                <img src="{{ public_path('images/contract/stamp.jpg') }}" width="150" height="150" style="margin-right: 30px;">
                            </td>
                            <td class="signature">
                                <img src="{{ public_path('images/contract/signature.png') }}" width="100" height="100" style="margin-right: 10px;">
                            </td>
                        </tr>
                    </table>
                </td>
            </tr>
        </table>
    </footer>
</div>

</body>
</html>
